STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_RCP_Cli_Cmd/STM32_WPAN/App/app_thread.c
}
/* USER CODE END FD_WRAP_FUNCTIONS */


static void APP_THREAD_joinerTimingElapsed( void )
{
	UTIL_SEQ_SetTask(TASK_JOIN_BUTTON,CFG_SCH_PRIO_0);
}

#if (CFG_USB_INTERFACE_ENABLE != 0)
/**
 * @brief  This function is called when thereare some data coming
 *         from the Hyperterminal via the USB port
 *         Data received over USB OUT endpoint are sent over CDC interface
 *         through this function.
 * @param  Buf: Buffer of data received
 * @param  Len: Number of data received (in bytes)
 * @retval Number of characters remaining in the buffer and not yet processed
 */
void VCP_DataReceived(uint8_t* Buf , uint32_t *Len)
{
  uint32_t i,flag_continue_checking = TRUE;
  uint32_t char_remaining = 0;
  static uint32_t len_total = 0;

  /* Copy the characters in the temporary buffer */
  for (i = 0; i < *Len; i++)
  {
    TmpString[len_total++] = Buf[i];
  }

  /* Process the buffer commands one by one     */
  /* A command is limited by a \r caracaters    */
  while (flag_continue_checking == TRUE)
  {
    char_remaining = ProcessCmdString(TmpString,len_total);
    /* If char_remaining is equal to len_total, it means that the command string is not yet
     * completed.
     * If char_remaining is equal to 0, it means that the command string has
     * been entirely processed.
     */
    if ((char_remaining == 0) || (char_remaining == len_total))
    {
      flag_continue_checking = FALSE;
    }
    len_total = char_remaining;
  }
}
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
/**
 * @brief Handles joiner commissioning
 * @param  None
 * @retval None
 */
void APP_THREAD_CommissioningJoin(void) {
uint8_t l_BlinkCpt = 30;

	if (JoinerState & 0xF0) {
		// Slow Blinking on going
		BSP_LED_Toggle(LED1);
	}

	switch (JoinerState & 0x0F) {
		case 0 : /* Default */
		  BSP_LED_Off(LED1);

		  if (joinerIPv6IfUp) {
			  joinerIPv6IfUp = FALSE;
			  /* First set ifconfig down*/
			  memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			  memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "ifconfig down\n\r", 15);
			  ThreadCliCmdBuffer.cmdserial.cmd.plen = 15;
			  ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			  /* Clear receive buffer, character counter and command complete */
			  CptReceiveCmdFromUser = 0;
			  indexReceiveChar = 0;
			  TL_CLI_SendCmd();

			  break;
		  }


		  memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
		  memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "ifconfig up\n\r", 13);
		  ThreadCliCmdBuffer.cmdserial.cmd.plen = 13;
		  ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;

		  /* Clear receive buffer, character counter and command complete */
		  CptReceiveCmdFromUser = 0;
		  indexReceiveChar = 0;
		  JoinerState = 1;

		  TL_CLI_SendCmd();
		  break;

		case 1 : /* ifconfig in progress */
		  joinerIPv6IfUp = TRUE;
		  memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
		  memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "joiner start STM32WB\n\r", 22);
		  ThreadCliCmdBuffer.cmdserial.cmd.plen = 22;
		  ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;

		  /* Clear receive buffer, character counter and command complete */
		  CptReceiveCmdFromUser = 0;
		  indexReceiveChar = 0;
		  JoinerState = 0xF2;

		  TL_CLI_SendCmd();

		  /* Start slow Blinking */
		  HW_TS_Start(joinerTimerID, (uint32_t)SLOW_BLINK_TIMEOUT);

		  break;
		case 2 : /* joining in progress */
			break;
		case 3 : /* joining over and OK */
			BSP_LED_On(LED1);
			JoinerState = 4;
			break;
		case 0x0F : /* joining Error case */
			HW_TS_Stop(joinerTimerID);
    		while(l_BlinkCpt--) {
				BSP_LED_Toggle(LED1);
				HAL_Delay(50U);
			  }
				BSP_LED_Off(LED1);
				JoinerState = 0;
			break;

		default :
			break;
	} //switch
}
/* USER CODE END FD_WRAP_FUNCTIONS */
